#+title:    Irkalla - Todo list!
#+author:   Icy-Thought
#+date:     2023-01-11

* :DONE: Things I ought to do!
- [-] Rounded corners in completion menu (corfu + rounded unicode borders?)
- [-] Fix Nix-Mode + Rust-Mode
- [-] Theme corfu with current used theme?? (+ opacity)
- [-] Fix folding in org-mode. (most likely a corfu isssue)
- [-] Corfu menu -> do not remain displayed after movement!
- [-] Corfu -> broken completions, won't close... (required ~corfu-preselect 'prompt~)
- [-] (ORG-MODE) =<Enter>= -> evaluate source blocks
  - [-] Haskell <- breaks emacs before evaluation == complete (remove `prompt-cont "|>"`)
  - [-] Add missing Rust babel (all languages if possible? or auto setup on buffer enter like lsp-install?)
- [-] (ORG-MODE) =<Enter>= -> evaluate latex block
- [-] (ORG-MODE) Completion and auto-fill blocks + template (tempepl?)
  - [-] Combine with tab complete in corfu
- [-] Less glitchy evil-mode undo?
- [-] Read upon undo-tree + how to retain undo after session restart!
- [-] ability to cycle backwards in mini-buffer.
- [-] PDF-Tools: things to fix
  - [-] Better dark mode
  - [-] +Opacity if possible+
  - [-] Disable number line -> doom modeline
- [-] +Have markdown look similar to org-modern?+
- [-] Snippets..
  - [-] Expand with tab <- corfu to mix with completions + tempel
- [] [...] ?
- [] Customize Emacs-conf to surpass nvim-conf

* :TODO: Actions
- LaTeX Setup (CDLaTeX + texlab-like compiling from nvim (tectonic???))
- [] (ORG-MODE) Rust babel
- [-] Get svg-tag-mode to show in other filetypes besides org -> comments only! (FIXME:)
- [-] Corfu -> quit on escape
- [] Completion + Tab behaviour.. (inser tab when no word prior to completion = desired)
- [] (ORG-MODE) Inline completion eglot.. (FIXME: issue with current eglot implementation!)
- [-] Get rid of white theme on cold-start without setting =load-theme=
- [] +Navigation inside emacs-dashboard to limit itself to items only!+ (not important..)
- [] Fix background of emacs dashboard logo + latex preview images! (FIXME: Emacs problem -> nothing to be fixed...)
- [-] Keymaps to match Doom Emacs?
- [] Better modeline design? <- ...
- [] Tell remaining applications to replace tabs -> 4 spaces!
- [-] Reduce startup time! (a continues process)

* Plugins to check out!
  - https://github.com/abo-abo/hydra
    - https://github.com/Ladicle/hydra-posframe
  - https://github.com/mkcms/interactive-align
  - https://github.com/emacs-lsp/dap-mode
  - (later) https://github.com/Emacs-Kotlin-Mode-Maintainers/kotlin-mode
  - https://gitlab.com/matsievskiysv/math-preview

** Extras...
  - https://github.com/narendraj9/hledger-mode
  - https://github.com/zerolfx/copilot.el
  - https://github.com/joshcho/ChatGPT.el
  - https://www.emacswiki.org/emacs/SmoothScrolling

Example rust block:
#+begin_src rustic :async
let x = 32;
let y = 12;


println!("{} and {} results in {}", x , y , x*y);
#+end_src

#+RESULTS:
: error: Could not compile `cargoPTcCqn`.
